{
    "name": "Chris Black",

    "position": "Software Developer",

    "address": {
        "street": "520 Rose Ln",
        "city-state-zip": "Raleigh, NC 27610"
    },

    "contact": {
        "phone": "520-269-5118",
        "email": "black@chrisblack.net"
    },

    "portfolio": "chrisblack.net",

    "skills": [
        "JavaScript",
        "TypeScript",
        "Aurelia",
        "React",
        "Vue.js",
        "Gatsby",
        "Next.js",
        "Node.js",
        "SQL",
        "NoSQL",
        "Firebase",
        "HTML",
        "CSS",
        "PHP"
    ],

    "footer": "This resume was generated from a JSON file using JavaScript. Code at www.github.com/thischrisblack/Resume-the-Hard-Way.",

    "professional experience": [
        {
            "project__name": "American Board of Radiology",
            "project__date": "2019 - Present",
            "project__link": "www.theabr.org",
            "project__description": "As a full-stack software developer, I have been primarily responsible for RADS, a board certification exam-creation web application meant to serve volunteers and the committees overseeing their efforts.",
            "project__accomplishments": [
                "From mockups or written requirements, I build features and workflows enabling exam creation and organization, image upload with in-browser editing, and status-tracking of proposed exam material through a multi-phase, multi-role approval process.", 
                "During the last year-plus of rapid development, I have twice initiated and executed rounds of code cleanup to reduce the growing complexity of the flux store and eliminate dead code. The last such session resulted in a final merge yielding 81 insertions and 2436 deletions.",
                "I routinely review the API code for optimization opportunities, including a recent discovery of a call returning 15MB of text data which took nearly 30s to fulfill. This response was reduced to 57KB/1.5s for the same view. I find this work tremendously satisfying.",
                "Other duties include code review, which I welcome as a learning opportunity whether reviewing or being reviewed; working with team leads and UX designers during feature planning and development; working with in-house users and QA during testing and further iteration."
            ],
            "project__skills": [
                "TypeScript",
                "Node.js",
                "Aurelia",
                "SQL",
                "HTML",
                "CSS",
                "Tailwind CSS Library"
            ]
        },
        {
            "project__name": "OpenForm",
            "project__date": "2019",
            "project__link": "www.openform.co",
            "project__description": "As a contractor for an award-winning strategy and design studio, I performed custom WordPress theme development.",
            "project__accomplishments": [
                "I reviewed the new WorPress Gutenberg editor for possible implementation in upcoming studio projects."
            ],
            "project__skills": [
                "PHP",
                "WordPress",
                "Gutenberg",
                "HTML",
                "CSS"
            ]
        },
        {
            "project__name": "Chicago Music Store",
            "project__date": "2008 - 2019",
            "project__link": "www.chicagomusicstore.com",
            "project__description": "While managing the sheet music department of a family-owned music store, I maintained the WordPress website, taught myself PHP/MySQL, and built the following tools:",
            "project__accomplishments": [
                "A web interface allowing customers to reserve musical instruments online. This tool currently accounts for 20% of their rental business, which itself is a vital part of the store's revenue.",
                "A tool to assist in ordering and tracking delivery of thousands of pieces of sheet music to dozens of different locations across the state, winning back the business of a music festival account worth $25-$30,000 in yearly sales. This tool automated a great deal of work, reducing a task that once took many days to a matter of hours.",
                "A contact management tool to assist with delinquent rental account collection calls, automating and organizing the task so that an entire round of calls to all delinquent accounts could be made once per day, rather than once per week. The app also generated reports on call volume and success, money owed and collected, and other metrics.",
                "An app for the collaborative organization of on-campus school \"Rental Season\" events. These events were previously planned with an assortment of Excel sheets on a shared drive, but moving the process to a web app kept information accessible and up-to-date, as well as providing useful calendar-based views."
            ],
            "project__skills": ["PHP", "WordPress", "HTML", "CSS", "JavaScript", "MySQL"]
        }
    ],

    "selected projects": [
        {
            "project__name": "Shelly Black's Website",
            "project__link": "github.com/thischrisblack/shelly-black-website",
            "project__description": "A blog for archivist/photographer Shelly Black, built on React with Next.js and deployed with Netlify.",
            "project__skills": ["React", "TypeScript", "Next.js", "Netlify"]
        },
        {
            "project__name": "Transmitter",
            "project__link": "github.com/thischrisblack/transmitter-gatsby",
            "project__description": "A previous version of my personal site, featuring a custom CMS and music player allowing users to sort tracks by mood.",
            "project__skills": ["React", "Gatsby", "Firebase", "NoSQL"]
        },
        {
            "project__name": "Emoji Disco",
            "project__link": "github.com/thischrisblack/emoji-disco",
            "project__description": "My first of likely many experiments with the Web Audio API. Upload a music file to get the party started.",
            "project__skills": ["JavaScript", "HTML", "CSS", "Web Audio API"]
        },
        {
            "project__name": "Glengarry Bob Ross",
            "project__link": "twitter.com/glengarrybob",
            "project__description": "A bot that tweets out images of Bob Ross captioned with lines from the film Glengarry Glen Ross.",
            "project__skills": ["JavaScript", "Node.js", "Heroku", "JIMP"]
        }
    ]
}
